text/02-prefix-to-infix.org
#+title: Chapter 2: Prefix To Infix Translator
* <<intro>>

In this chapter we shall design a very small translator from one simple language to another simple language.  The two languages chosen are for the propositional calculus in logic.  The reason for choosing logic languages is that every symbol needed is a single character.  This makes the processing of languages particularly easy.

* Infix and Prefix Notation

We begin by giving a definition of FORMULA in infix notation:

#+begin_example
1) A lower case letter, i.e. 'a', 'b' .. 'z' is a formula.
2) If p is a formula, then the following is  also a formula:
	-p			- negation
3) If p and q are formulas, then the following are also formulas:
	(p & q)			- conjunction
	(p v q)			- disjunction
	(p > q)			- conditional
	(p = q)			- equivalence
#+end_example

Nothing else is a formula.  For our purposes it was not necessary to specify compound formulas as negations, conjunctions and so on, since in this chapter we are not concerned with meaning.  Note that we have used the common convention of using p and q as variables ranging over arbitrary formulas, even though they are also real formulas.  An alternative way of describing formulas is:

#+begin_example
A formula is either
	a lower case letter, or
	the symbol '-'
	  followed by a formula, or
	the symbol '('
	  followed by a formula
	  followed by one of the symbols '&', 'v' '>' or '='
	  followed by a formula
	  followed by the symbol ')'
#+end_example

Parentheses serve to indicate which subformulas belong to which infix operator.  It is possible to eliminate the need for parentheses completely by the following technique: Replace the left parenthesis by the operator, delete the operator in its infix position, and also delete the right parenthesis.  Then every operator, whether unary or binary, has to be followed by the appropriate number of subformulas, namely one or two.  Because the operators always precede their operands, this notation is called prefix notation.  The device was invented by Polish logicians in the 1930's and is often called Polish notation.  We shall follow their tradition by using capital letters for the operators: one unary operator 'N' which means negation, and four binary operators 'K', 'A', 'C' and 'E' which mean conjunction, alternation (=disjunction), conditional and equivalence.  A semi-formal grammar thus is:

#+begin_example
A formula is either
	a lower case letter, or
	the symbol 'N'
	  followed by a formula, or
	one of the symbols 'K', 'A', 'C' or 'E'
	  followed by two formulas
#+end_example

We now have two notations for propositional logic, and we intend to write a program which can translate from prefix notation to infix notation.  The reason we choose this particular translation is none other than that it is very easy to write the program.  But first we have to specify the translation from prefix to infix.  One way to do so is by a translation grammar:

#+begin_example
A prefix formula is either
    'a' or 'b' or .. or 'z'	
	and its infix translation is itself, or
    'N' F
	    where F is a prefix formula,
	and its infix translation is:  '-' G
	    where G is the infix translation of F, or
    'A' F1 F2
	    where F1 and F2 are prefix formulas,
	and its infix translation is:  '(' G1 'v' G2 ')'
	    where G1 and G2 are infix translations of F1 and F2, or
    'C' F1 F2
	    where F1 and F2 are prefix formulas,
	and its infix translation is:  '(' G1 '>' G2 ')'
	    where G1 and G2 are infix translations of F1 and F2, or
    'E' F1 F2
	    where F1 and F2 are prefix formulas,
	and its infix translation is:  '(' G1 '=' G2 ')'
	    where G1 and G2 are infix translations of F1 and F2, or
    'K' F1 F2
	    where F1 and F2 are prefix formulas,
	and its infix translation is:  '(' G1 '&' G2 ')'
	    where G1 and G2 are infix translations of F1 and F2.
#+end_example

In the official manual to follow, the input language and the output language are specified by a grammar written in what is called BNF notation.  Such a grammar consists of one or more "productions".  A production consists of a "non-terminal" symbol, followed by the three characters "::=", which may be read as "is", followed by an "expression".  An expression is built from terminal symbols (which are quoted) and non-terminal symbols by means of two operations: 1) concatenation, which means "followed by", and 2) the infix alternation operator "|", which means "or".  Concatenation takes precedence over alternation, and parentheses may be used to override these precedences.  We also use the ellipsis ".." for material to be interpolated in some obvious way.  You should compare the BNF grammars in the manual with the equivalent informal grammars given earlier.

