02-prefix-to-infix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 2: Prefix To Infix Translator</title>
<!-- 2013-05-31 Fri 19:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="michal"/>
<link rel="stylesheet" type="text/css" href="/sympas/etc/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Chapter 2: Prefix To Infix Translator</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Infix and Prefix Notation</a></li>
<li><a href="#sec-2">2. User Manual</a></li>
<li><a href="#sec-3">3. Designing the Implementation</a></li>
<li><a href="#sec-4">4. The Program</a></li>
<li><a href="#sec-5">5. Exercises And Reading</a>
<ul>
<li><a href="#sec-5-1">5.1. <i>OTHERWISE</i>:</a></li>
<li><a href="#sec-5-2">5.2. <i>Statistics</i>:</a></li>
<li><a href="#sec-5-3">5.3. <i>Postfix</i>:</a></li>
<li><a href="#sec-5-4">5.4. <i>No outermost parentheses</i>:</a></li>
<li><a href="#sec-5-5">5.5. <i>Further minimisation of parentheses</i>:</a></li>
<li><a href="#sec-5-6">5.6. <i>Multi-line input</i>:</a></li>
<li><a href="#sec-5-7">5.7. <i>Elimination of recursion</i>:</a></li>
<li><a href="#sec-5-8">5.8. <i>Proof reading</i>:</a></li>
<li><a href="#sec-5-9">5.9. <i>Cambridge notation</i>:</a></li>
<li><a href="#sec-5-10">5.10. <i>More difficult translations</i>:</a></li>
<li><a href="#sec-5-11">5.11. <i>Eliminate GOTO</i>:</a></li>
<li><a href="#sec-5-12">5.12. <i>Reading</i>:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
In this chapter we shall design a very small translator from one simple language to another simple language.  The two languages chosen are for the propositional calculus in logic.  The reason for choosing logic languages is that every symbol needed is a single character.  This makes the processing of languages particularly easy.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Infix and Prefix Notation</h2>
<div class="outline-text-2" id="text-1">
<p>
We begin by giving a definition of FORMULA in infix notation:
</p>

<pre class="example">
1) A lower case letter, i.e. 'a', 'b' .. 'z' is a formula.
2) If p is a formula, then the following is  also a formula:
        -p                      - negation
3) If p and q are formulas, then the following are also formulas:
        (p &amp; q)                 - conjunction
        (p v q)                 - disjunction
        (p &gt; q)                 - conditional
        (p = q)                 - equivalence
</pre>

<p>
Nothing else is a formula.  For our purposes it was not necessary to specify compound formulas as negations, conjunctions and so on, since in this chapter we are not concerned with meaning.  Note that we have used the common convention of using p and q as variables ranging over arbitrary formulas, even though they are also real formulas.  An alternative way of describing formulas is:
</p>

<pre class="example">
A formula is either
        a lower case letter, or
        the symbol '-'
          followed by a formula, or
        the symbol '('
          followed by a formula
          followed by one of the symbols '&amp;', 'v' '&gt;' or '='
          followed by a formula
          followed by the symbol ')'
</pre>

<p>
Parentheses serve to indicate which subformulas belong to which infix operator.  It is possible to eliminate the need for parentheses completely by the following technique: Replace the left parenthesis by the operator, delete the operator in its infix position, and also delete the right parenthesis.  Then every operator, whether unary or binary, has to be followed by the appropriate number of subformulas, namely one or two.  Because the operators always precede their operands, this notation is called prefix notation.  The device was invented by Polish logicians in the 1930's and is often called Polish notation.  We shall follow their tradition by using capital letters for the operators: one unary operator 'N' which means negation, and four binary operators 'K', 'A', 'C' and 'E' which mean conjunction, alternation (=disjunction), conditional and equivalence.  A semi-formal grammar thus is:
</p>

<pre class="example">
A formula is either
        a lower case letter, or
        the symbol 'N'
          followed by a formula, or
        one of the symbols 'K', 'A', 'C' or 'E'
          followed by two formulas
</pre>

<p>
We now have two notations for propositional logic, and we intend to write a program which can translate from prefix notation to infix notation.  The reason we choose this particular translation is none other than that it is very easy to write the program.  But first we have to specify the translation from prefix to infix.  One way to do so is by a translation grammar:
</p>

<pre class="example">
A prefix formula is either
    'a' or 'b' or .. or 'z'     
        and its infix translation is itself, or
    'N' F
            where F is a prefix formula,
        and its infix translation is:  '-' G
            where G is the infix translation of F, or
    'A' F1 F2
            where F1 and F2 are prefix formulas,
        and its infix translation is:  '(' G1 'v' G2 ')'
            where G1 and G2 are infix translations of F1 and F2, or
    'C' F1 F2
            where F1 and F2 are prefix formulas,
        and its infix translation is:  '(' G1 '&gt;' G2 ')'
            where G1 and G2 are infix translations of F1 and F2, or
    'E' F1 F2
            where F1 and F2 are prefix formulas,
        and its infix translation is:  '(' G1 '=' G2 ')'
            where G1 and G2 are infix translations of F1 and F2, or
    'K' F1 F2
            where F1 and F2 are prefix formulas,
        and its infix translation is:  '(' G1 '&amp;' G2 ')'
            where G1 and G2 are infix translations of F1 and F2.
</pre>

<p>
In the official manual to follow, the input language and the output language are specified by a grammar written in what is called BNF notation.  Such a grammar consists of one or more "productions".  A production consists of a "non-terminal" symbol, followed by the three characters "::=", which may be read as "is", followed by an "expression".  An expression is built from terminal symbols (which are quoted) and non-terminal symbols by means of two operations: 1) concatenation, which means "followed by", and 2) the infix alternation operator "|", which means "or".  Concatenation takes precedence over alternation, and parentheses may be used to override these precedences.  We also use the ellipsis ".." for material to be interpolated in some obvious way.  You should compare the BNF grammars in the manual with the equivalent informal grammars given earlier.
</p>
</div>
</div>
