text/02-prefix-to-infix.org
* User Manual

The program PREINF translates logical formulas in prefix notation to formulas in infix notation.  In the standard interpretations of the two notations, an output formula is logically equivalent to its input formula.

The BNF grammar for the input formulas in prefix notation is as follows:

#+begin_src ebnf
formula  ::=
	'a' | 'b' | .. | 'z' |
	'N' formula |
	( 'A' | 'C' | 'E' | 'K' ) formula formula
#+end_src

The program indicates its readiness to read a prefix formula with the prompt "Formula :".  When reading it ignores white space such as blanks and tabs, for readability it is often desirable to include white space inside longer formulas.  The program also treats new lines as white space and ignores them.  However, it is better not to break a formula over several lines because part of the translation of the previous line will appear as soon as that line is terminated, and thus interfere with the next input line.

The BNF grammar for the output in fully parenthesised infix notation is as follows:

#+begin_src bnf
formula  ::=
	'a' | 'b' | .. | 'z' |
	'-' formula |
	'(' formula ( 'v' | '&' | '>' | '=' ) formula ')'
#+end_src

For readability, the program surrounds the infix operators with spaces.  Atomic formulas 'a', 'b' .. 'z' are translated as themselves.  Compound formulas built from one or two subformulas are translated by translating the subformulas and building an infix formula from the translations of the subformulas.  The translation of the operators is given by the following table:


| Prefix Operator: | N | A | C | E | K |
| Infix  Operator: | - | v | > | \equal | & |

Some sample translations are:

| Prefix:        | Infix:               |
|----------------+----------------------|
| p              | p                    |
| Nq             | -q                   |
| K Np q         | (-p & q)             |
| A N K Np q r   | (-(-p & q) v r)      |
| C E p q C Nq p | ((p = q) > (-q > p)) |


If during the reading of a formula a printing character is detected which cannot be the beginning of a legal formula in prefix, then an error message is produced and the rest of the input line is ignored.  For example, when the offending character is X, the error message will be:

#+begin_src text
Error : seen "X" when "a".."z","N","A","C","E" or "K" expected
#+end_src

The program terminates when the end of the input file is reached.  If this occurs halfway through a formula, then no error is signalled.

