02-prefix-to-infix.html
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> User Manual</h2>
<div class="outline-text-2" id="text-2">
<p>
The program PREINF translates logical formulas in prefix notation to formulas in infix notation.  In the standard interpretations of the two notations, an output formula is logically equivalent to its input formula.
</p>

<p>
The BNF grammar for the input formulas in prefix notation is as follows:
</p>

<div class="org-src-container">

<pre class="src src-ebnf">formula  ::=
        'a' | 'b' | .. | 'z' |
        'N' formula |
        ( 'A' | 'C' | 'E' | 'K' ) formula formula
</pre>
</div>

<p>
The program indicates its readiness to read a prefix formula with the prompt "Formula :".  When reading it ignores white space such as blanks and tabs, for readability it is often desirable to include white space inside longer formulas.  The program also treats new lines as white space and ignores them.  However, it is better not to break a formula over several lines because part of the translation of the previous line will appear as soon as that line is terminated, and thus interfere with the next input line.
</p>

<p>
The BNF grammar for the output in fully parenthesised infix notation is as follows:
</p>

<div class="org-src-container">

<pre class="src src-bnf">formula  ::=
        'a' | 'b' | .. | 'z' |
        '-' formula |
        '(' formula ( 'v' | '&amp;' | '&gt;' | '=' ) formula ')'
</pre>
</div>

<p>
For readability, the program surrounds the infix operators with spaces.  Atomic formulas 'a', 'b' .. 'z' are translated as themselves.  Compound formulas built from one or two subformulas are translated by translating the subformulas and building an infix formula from the translations of the subformulas.  The translation of the operators is given by the following table:
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left">Prefix Operator:</td>
<td class="left">N</td>
<td class="left">A</td>
<td class="left">C</td>
<td class="left">E</td>
<td class="left">K</td>
</tr>

<tr>
<td class="left">Infix  Operator:</td>
<td class="left">-</td>
<td class="left">v</td>
<td class="left">&gt;</td>
<td class="left">=</td>
<td class="left">&amp;</td>
</tr>
</tbody>
</table>

<p>
Some sample translations are:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Prefix:</th>
<th scope="col" class="left">Infix:</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">p</td>
<td class="left">p</td>
</tr>

<tr>
<td class="left">Nq</td>
<td class="left">-q</td>
</tr>

<tr>
<td class="left">K Np q</td>
<td class="left">(-p &amp; q)</td>
</tr>

<tr>
<td class="left">A N K Np q r</td>
<td class="left">(-(-p &amp; q) v r)</td>
</tr>

<tr>
<td class="left">C E p q C Nq p</td>
<td class="left">((p = q) &gt; (-q &gt; p))</td>
</tr>
</tbody>
</table>


<p>
If during the reading of a formula a printing character is detected which cannot be the beginning of a legal formula in prefix, then an error message is produced and the rest of the input line is ignored.  For example, when the offending character is X, the error message will be:
</p>

<div class="org-src-container">

<pre class="src src-text">Error : seen "X" when "a".."z","N","A","C","E" or "K" expected
</pre>
</div>

<p>
The program terminates when the end of the input file is reached.  If this occurs halfway through a formula, then no error is signalled.
</p>
</div>
</div>
