text/02-prefix-to-infix.org
* Designing the Implementation

To be able to write this program, you should know about variables, flow of control (including procedure calls), reading characters and writing strings of characters.  You should also know about arrays.  You need not know about recursion - this may well be the first recursive program you have seen.  Probably this is quite a good first example problem which is best solved recursively.  If you have understood the translation grammar, you are well on the way.

One way of specifying which character is the translation of a given prefix operator is by means of a table, best implemented as an array.  Since this never changes, the program begins by initialising the translation table at the few capital letters that are actually used as prefix operators, the values assigned are the characters which serve as the corresponding operators for the infix notation.

Then the program enters a REPEAT loop.  There it writes a new line; this is to terminate the previous translation, if any.  Then it writes the prompt on a line.  Then it calls a procedure which we call /prefix/, because it has essentially the structure of the grammar for prefix formulas.  This procedure will read a formula in prefix and translate it to infix.  Then it writes a new line.  The REPEAT loop goes nominally forever.

The procedure /prefix/ has a local variable which is generally the last printing character that has been read.  The body of the procedure has to first read the next printing character, and then take some action depending on what the character was.

To read the first printing character, the procedure enters a loop: first it tests whether the end of the input file has been reached, if so the procedure jumps to the end of the program and exits.  If not, the procedure reads the next character from the input file and puts it into the the local variable.  This is repeated until the last character read was indeed a printing character, and not white space.  If during this loop the end of the input file is reached, the procedure jumps to the end of the program.

At this point the character will be a printing character.  Now a choice has to made by the procedure:

1) If the character is a lower case letter, then it just has to write it out again.

2) If the character is the letter 'N', then it writes the translation of 'N' (which is '-') and then the procedure calls itself recursively once in order to translate the negand.

3) If the character is one of the binary operators 'A', 'C', 'E' or 'K', then it writes the required opening parenthesis, then it calls itself recursively to translate the first subformula, then it writes the character which is the translation of the binary operator that is seen, but surrounding it with one space to the left and one to the right, then it calls itself recursively to translate the second subformula, and finally it writes the closing parenthesis.

4) However, if the character is none of the above, then the procedure writes the error message, skips the rest of the input line and jumps to the beginning of the REPEAT loop of the main program.  The choice is best made by a CASE statement.  All of this follows the translation grammar quite closely.

In later chapters the descriptions of programs given will be at the level of detail of the preceding description.  However, since this may well be the first PASCAL program that you see or write, we now give a version in what is called pseudo-code: it is neither PASCAL nor English, but something somewhere in between.

#+begin_src pascal
PROGRAM to translate from prefix to infix;
Declare a translation table for the operators;
PROCEDURE prefix;
read the next printing character from the input
	(but if end of file is reached, jump to end of program)
CASE this character OF
	a lower case letter:
	    write the character to the output;
	the letter 'N':
	    write the translation of 'N'
	    CALL PROCEDURE prefix
	one of the letters 'A', 'C', 'E', 'K':
	    write '('
	    CALL PROCEDURE prefix
	    write the translation of the character
	    CALL PROCEDURE prefix
	    write ')'
	anything else:
	    write an error message, ignore rest of line
	    jump to prompt writing in main program
END of prefix;
BEGIN main program
initialise the translation table -	A C E K N    (prefix)
					v > = & -    (infix)
REPEATEDLY
	write a prompt 'Formula :'
	CALL PROCEDURE prefix (to read and translate a formula)
END main program
#+end_src

