02-prefix-to-infix.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Designing the Implementation</h2>
<div class="outline-text-2" id="text-3">
<p>
To be able to write this program, you should know about variables, flow of control (including procedure calls), reading characters and writing strings of characters.  You should also know about arrays.  You need not know about recursion - this may well be the first recursive program you have seen.  Probably this is quite a good first example problem which is best solved recursively.  If you have understood the translation grammar, you are well on the way.
</p>

<p>
One way of specifying which character is the translation of a given prefix operator is by means of a table, best implemented as an array.  Since this never changes, the program begins by initialising the translation table at the few capital letters that are actually used as prefix operators, the values assigned are the characters which serve as the corresponding operators for the infix notation.
</p>

<p>
Then the program enters a REPEAT loop.  There it writes a new line; this is to terminate the previous translation, if any.  Then it writes the prompt on a line.  Then it calls a procedure which we call <i>prefix</i>, because it has essentially the structure of the grammar for prefix formulas.  This procedure will read a formula in prefix and translate it to infix.  Then it writes a new line.  The REPEAT loop goes nominally forever.
</p>

<p>
The procedure <i>prefix</i> has a local variable which is generally the last printing character that has been read.  The body of the procedure has to first read the next printing character, and then take some action depending on what the character was.
</p>

<p>
To read the first printing character, the procedure enters a loop: first it tests whether the end of the input file has been reached, if so the procedure jumps to the end of the program and exits.  If not, the procedure reads the next character from the input file and puts it into the the local variable.  This is repeated until the last character read was indeed a printing character, and not white space.  If during this loop the end of the input file is reached, the procedure jumps to the end of the program.
</p>

<p>
At this point the character will be a printing character.  Now a choice has to made by the procedure:
</p>

<ol class="org-ol">
<li>If the character is a lower case letter, then it just has to write it out again.
</li>

<li>If the character is the letter 'N', then it writes the translation of 'N' (which is '-') and then the procedure calls itself recursively once in order to translate the negand.
</li>

<li>If the character is one of the binary operators 'A', 'C', 'E' or 'K', then it writes the required opening parenthesis, then it calls itself recursively to translate the first subformula, then it writes the character which is the translation of the binary operator that is seen, but surrounding it with one space to the left and one to the right, then it calls itself recursively to translate the second subformula, and finally it writes the closing parenthesis.
</li>

<li>However, if the character is none of the above, then the procedure writes the error message, skips the rest of the input line and jumps to the beginning of the REPEAT loop of the main program.  The choice is best made by a CASE statement.  All of this follows the translation grammar quite closely.
</li>
</ol>

<p>
In later chapters the descriptions of programs given will be at the level of detail of the preceding description.  However, since this may well be the first PASCAL program that you see or write, we now give a version in what is called pseudo-code: it is neither PASCAL nor English, but something somewhere in between.
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #00ffff;">PROGRAM</span> <span style="color: #ffffff; font-weight: bold;">to</span> translate from prefix <span style="color: #00ffff;">to</span> infix;
Declare a translation table <span style="color: #00ffff;">for</span> the operators;
<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">prefix</span>;
<span style="color: #00ffff;">read</span> the next printing character from the input
        (but <span style="color: #00ffff;">if</span> <span style="color: #00ffff;">end</span> <span style="color: #00ffff;">of</span> <span style="color: #ff00ff;">file</span> <span style="color: #00ffff;">is</span> reached, jump <span style="color: #00ffff;">to</span> <span style="color: #00ffff;">end</span> <span style="color: #00ffff;">of</span> program)
<span style="color: #00ffff;">CASE</span> this character <span style="color: #00ffff;">OF</span>
        a lower <span style="color: #00ffff;">case</span> letter:
            <span style="color: #00ffff;">write</span> the character <span style="color: #00ffff;">to</span> the output;
        the letter <span style="color: #00ff00;">'N'</span>:
            <span style="color: #00ffff;">write</span> the translation <span style="color: #00ffff;">of</span> <span style="color: #00ff00;">'N'</span>
            CALL PROCEDURE prefix
        one <span style="color: #00ffff;">of</span> the letters <span style="color: #00ff00;">'A'</span>, <span style="color: #00ff00;">'C'</span>, <span style="color: #00ff00;">'E'</span>, <span style="color: #00ff00;">'K'</span>:
            <span style="color: #00ffff;">write</span> <span style="color: #00ff00;">'('</span>
            CALL PROCEDURE prefix
            <span style="color: #00ffff;">write</span> the translation <span style="color: #00ffff;">of</span> the character
            CALL PROCEDURE prefix
            <span style="color: #00ffff;">write</span> <span style="color: #00ff00;">')'</span>
        anything <span style="color: #00ffff;">else</span>:
            <span style="color: #00ffff;">write</span> an error <span style="color: #00ffff;">message</span>, ignore rest <span style="color: #00ffff;">of</span> line
            jump <span style="color: #00ffff;">to</span> prompt writing <span style="color: #00ffff;">in</span> main program
<span style="color: #00ffff;">END</span> <span style="color: #00ffff;">of</span> prefix;
<span style="color: #00ffff;">BEGIN</span> main program
initialise the translation table -      A C E K N    (prefix)
                                        v &gt; = &amp; -    (infix)
REPEATEDLY
        <span style="color: #00ffff;">write</span> a prompt <span style="color: #00ff00;">'Formula :'</span>
        CALL PROCEDURE prefix (<span style="color: #00ffff;">to</span> <span style="color: #00ffff;">read</span> <span style="color: #00ffff;">and</span> translate a formula)
<span style="color: #00ffff;">END</span> main program
</pre>
</div>
</div>
</div>
