text/02-prefix-to-infix.org
* The Program

Here is the complete program:

#+begin_src pascal
PROGRAM prefix_to_infix(input,output);

LABEL 1, 99;

VAR t : ARRAY[char] OF char;

PROCEDURE prefix;
VAR ch : char;
BEGIN (* prefix *)
REPEAT
    IF eof THEN GOTO 99;
    read(ch)
    UNTIL ch > ' ';
CASE ch OF
    'a','b','c','d','e','f','g','h','i','j','k','l','m',
    'n','o','p','q','r','s','t','u','v','w','x','y','z' :
        write(ch);
    'N' :
        BEGIN
        write(t[ch]); prefix
        END;
    'A','C','E','K' :
        BEGIN
        write('(');
        prefix; write(' ',t[ch],' '); prefix;
        write(')')
        END;
    OTHERWISE
        BEGIN
        writeln;
        writeln('Error : seen "',ch,
            '" when "a".."z","N","A","C","E" or "K" expected.');
        readln;
        GOTO 1
        END;
    END (* CASE *)
END; (* prefix *)

BEGIN (* main *)
t['A']:='v'; t['C']:='>'; t['E']:='='; t['K']:='&'; t['N']:='-';
1:
REPEAT
    writeln;
    writeln('Formula :');
    prefix;
    writeln;
    UNTIL false;
99:
END.
#+end_src

* Exercises And Reading

** /OTHERWISE/:

In standard PASCAL there is no OTHERWISE in CASE statements.  It is always possible to rewrite a CASE statement without the OTHERWISE, by wrapping it inside an IF-THEN-ELSE:

#+begin_src pascal
	IF we have a normal case THEN
	    CASE
		...
	  ELSE here the otherwise statement
#+end_src

Rewrite procedure /prefix/ in this manner.

** /Statistics/:

Modify the program so that it keeps a count of the total number of formulas that it has translated, and also a count of the total number of errors encountered.  Before the program exits, it should then print these statistics.

** /Postfix/:

Give a grammar for postfix notation, which is like prefix notation except that the operators are written after the subformulas.  Write a translation grammar from prefix to postfix.  Modify the manual, and modify the program so that it translates into postfix.

** /No outermost parentheses/:

Modify the original prefix to infix translator so that it does not write the outermost parentheses if any.  So "Kpq" should be translated as "p & q", "C N A a b c" as "-(a v b) > c".  But you should also write an informal or formal grammar for this infix notation, and a translation grammar.  This is probably harder than just fixing the program.

** /Further minimisation of parentheses/:

By giving the infix operators a precedence it is possible to further reduce the need for parentheses.  One possibility is to let "&" take precedence over "v" which takes precedence over "_>" and "=" which have the same precedence.  Thus "a & b v c & d" will be understood as "(a & b) v (c & d)".  Rewrite the translator so that it uses precedences in the infix notation.  Rewrite the manual, too.

** /Multi-line input/:

Modify the program (and the manual) so that input formulas written over several lines are treated better.

** /Elimination of recursion/:

When one has a recursive problem, in general the best way to solve it is to use a recursive solution.  In our case we were dealing with formulas which were defined recursively, and the simplest way to parse and translate them was to use the recursion facility provided by PASCAL.  Rewrite either the original program or one of the later versions without using any recursive procedures.

** /Proof reading/:

Read the Manual with extreme care and determine whether it correctly describes a) the intention of the designer, and b) the actual translation program.  Also, compare the informal style in which the translation was specified in the manual with the formal translation grammar given earlier.  Assuming that users are already familiar with the two notations, which style of specifying the translation is better?  Which style is more helpful for writing the program?

** /Cambridge notation/:

This is a prefix notation in which at least conjunction and disjunction (the associative operators) can have more than two operands.  Parentheses are used before the operator and after the last operand.  Implement a Cambridge to infix translator.  To make the notation more like LISP, you could use AND and OR; for other operators use NOT, IMP and IFF.  An input formula might then look like this:

#+begin_src pascal
    (AND (OR a b c) (NOT (OR d e (NOT f))) (OR g h (AND i j k l)))
#+end_src

Does it make sense to allow conjunctions and disjunctions with only one operand?  Does it make sense to allow implication and equivalence to take more than two operands?  Does it make sense to allow negation to have more than one operand?  Can one make sense of operators with zero operands?  Discuss these questions, and then implement your views in a Cambridge to infix translator.

