02-prefix-to-infix.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> The Program</h2>
<div class="outline-text-2" id="text-4">
<p>
Here is the complete program:
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #00ffff;">PROGRAM</span> <span style="color: #ffffff; font-weight: bold;">prefix_to_infix</span>(input,output);

LABEL 1, 99;

<span style="color: #ff00ff;">VAR</span> t : <span style="color: #ff00ff;">ARRAY</span>[<span style="color: #ff00ff;">char</span>] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">char</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">prefix</span>;
<span style="color: #ff00ff;">VAR</span> ch : <span style="color: #ff00ff;">char</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">prefix *)</span>
<span style="color: #00ffff;">REPEAT</span>
    <span style="color: #00ffff;">IF</span> eof <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">99</span>;
    <span style="color: #00ffff;">read</span>(ch)
    <span style="color: #00ffff;">UNTIL</span> ch &gt; <span style="color: #00ff00;">' '</span>;
<span style="color: #00ffff;">CASE</span> ch <span style="color: #00ffff;">OF</span>
    <span style="color: #00ff00;">'a'</span>,<span style="color: #00ff00;">'b'</span>,<span style="color: #00ff00;">'c'</span>,<span style="color: #00ff00;">'d'</span>,<span style="color: #00ff00;">'e'</span>,<span style="color: #00ff00;">'f'</span>,<span style="color: #00ff00;">'g'</span>,<span style="color: #00ff00;">'h'</span>,<span style="color: #00ff00;">'i'</span>,<span style="color: #00ff00;">'j'</span>,<span style="color: #00ff00;">'k'</span>,<span style="color: #00ff00;">'l'</span>,<span style="color: #00ff00;">'m'</span>,
    <span style="color: #00ff00;">'n'</span>,<span style="color: #00ff00;">'o'</span>,<span style="color: #00ff00;">'p'</span>,<span style="color: #00ff00;">'q'</span>,<span style="color: #00ff00;">'r'</span>,<span style="color: #00ff00;">'s'</span>,<span style="color: #00ff00;">'t'</span>,<span style="color: #00ff00;">'u'</span>,<span style="color: #00ff00;">'v'</span>,<span style="color: #00ff00;">'w'</span>,<span style="color: #00ff00;">'x'</span>,<span style="color: #00ff00;">'y'</span>,<span style="color: #00ff00;">'z'</span> :
        <span style="color: #00ffff;">write</span>(ch);
    <span style="color: #00ff00;">'N'</span> :
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">write</span>(t[ch]); prefix
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ff00;">'A'</span>,<span style="color: #00ff00;">'C'</span>,<span style="color: #00ff00;">'E'</span>,<span style="color: #00ff00;">'K'</span> :
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">write</span>(<span style="color: #00ff00;">'('</span>);
        prefix; <span style="color: #00ffff;">write</span>(<span style="color: #00ff00;">' '</span>,t[ch],<span style="color: #00ff00;">' '</span>); prefix;
        <span style="color: #00ffff;">write</span>(<span style="color: #00ff00;">')'</span>)
        <span style="color: #00ffff;">END</span>;
    OTHERWISE
        <span style="color: #00ffff;">BEGIN</span>
        writeln;
        writeln(<span style="color: #00ff00;">'Error : seen "'</span>,ch,
            <span style="color: #00ff00;">'" when "a".."z","N","A","C","E" or "K" expected.'</span>);
        readln;
        <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">1</span>
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">prefix *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">main *)</span>
t[<span style="color: #00ff00;">'A'</span>]:=<span style="color: #00ff00;">'v'</span>; t[<span style="color: #00ff00;">'C'</span>]:=<span style="color: #00ff00;">'&gt;'</span>; t[<span style="color: #00ff00;">'E'</span>]:=<span style="color: #00ff00;">'='</span>; t[<span style="color: #00ff00;">'K'</span>]:=<span style="color: #00ff00;">'&amp;'</span>; t[<span style="color: #00ff00;">'N'</span>]:=<span style="color: #00ff00;">'-'</span>;
1:
<span style="color: #00ffff;">REPEAT</span>
    writeln;
    writeln(<span style="color: #00ff00;">'Formula :'</span>);
    prefix;
    writeln;
    <span style="color: #00ffff;">UNTIL</span> false;
99:
<span style="color: #00ffff;">END</span>.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Exercises And Reading</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <i>OTHERWISE</i>:</h3>
<div class="outline-text-3" id="text-5-1">
<p>
In standard PASCAL there is no OTHERWISE in CASE statements.  It is always possible to rewrite a CASE statement without the OTHERWISE, by wrapping it inside an IF-THEN-ELSE:
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #00ffff;">IF</span> we have a normal <span style="color: #00ffff;">case</span> <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">CASE</span>
        ...
  <span style="color: #00ffff;">ELSE</span> here the otherwise statement
</pre>
</div>

<p>
Rewrite procedure <i>prefix</i> in this manner.
</p>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> <i>Statistics</i>:</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Modify the program so that it keeps a count of the total number of formulas that it has translated, and also a count of the total number of errors encountered.  Before the program exits, it should then print these statistics.
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> <i>Postfix</i>:</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Give a grammar for postfix notation, which is like prefix notation except that the operators are written after the subformulas.  Write a translation grammar from prefix to postfix.  Modify the manual, and modify the program so that it translates into postfix.
</p>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> <i>No outermost parentheses</i>:</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Modify the original prefix to infix translator so that it does not write the outermost parentheses if any.  So "Kpq" should be translated as "p &amp; q", "C N A a b c" as "-(a v b) &gt; c".  But you should also write an informal or formal grammar for this infix notation, and a translation grammar.  This is probably harder than just fixing the program.
</p>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> <i>Further minimisation of parentheses</i>:</h3>
<div class="outline-text-3" id="text-5-5">
<p>
By giving the infix operators a precedence it is possible to further reduce the need for parentheses.  One possibility is to let "&amp;" take precedence over "v" which takes precedence over "_&gt;" and "=" which have the same precedence.  Thus "a &amp; b v c &amp; d" will be understood as "(a &amp; b) v (c &amp; d)".  Rewrite the translator so that it uses precedences in the infix notation.  Rewrite the manual, too.
</p>
</div>
</div>
<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> <i>Multi-line input</i>:</h3>
<div class="outline-text-3" id="text-5-6">
<p>
Modify the program (and the manual) so that input formulas written over several lines are treated better.
</p>
</div>
</div>
<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> <i>Elimination of recursion</i>:</h3>
<div class="outline-text-3" id="text-5-7">
<p>
When one has a recursive problem, in general the best way to solve it is to use a recursive solution.  In our case we were dealing with formulas which were defined recursively, and the simplest way to parse and translate them was to use the recursion facility provided by PASCAL.  Rewrite either the original program or one of the later versions without using any recursive procedures.
</p>
</div>
</div>
<div id="outline-container-sec-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> <i>Proof reading</i>:</h3>
<div class="outline-text-3" id="text-5-8">
<p>
Read the Manual with extreme care and determine whether it correctly describes a) the intention of the designer, and b) the actual translation program.  Also, compare the informal style in which the translation was specified in the manual with the formal translation grammar given earlier.  Assuming that users are already familiar with the two notations, which style of specifying the translation is better?  Which style is more helpful for writing the program?
</p>
</div>
</div>
<div id="outline-container-sec-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> <i>Cambridge notation</i>:</h3>
<div class="outline-text-3" id="text-5-9">
<p>
This is a prefix notation in which at least conjunction and disjunction (the associative operators) can have more than two operands.  Parentheses are used before the operator and after the last operand.  Implement a Cambridge to infix translator.  To make the notation more like LISP, you could use AND and OR; for other operators use NOT, IMP and IFF.  An input formula might then look like this:
</p>

<div class="org-src-container">

<pre class="src src-pascal">(<span style="color: #00ffff;">AND</span> (<span style="color: #00ffff;">OR</span> a b c) (<span style="color: #00ffff;">NOT</span> (<span style="color: #00ffff;">OR</span> d e (<span style="color: #00ffff;">NOT</span> f))) (<span style="color: #00ffff;">OR</span> g h (<span style="color: #00ffff;">AND</span> i j k l)))
</pre>
</div>

<p>
Does it make sense to allow conjunctions and disjunctions with only one operand?  Does it make sense to allow implication and equivalence to take more than two operands?  Does it make sense to allow negation to have more than one operand?  Can one make sense of operators with zero operands?  Discuss these questions, and then implement your views in a Cambridge to infix translator.
</p>
</div>
</div>
