text/02-prefix-to-infix.org
** /More difficult translations/:

Why is there no exercise to translate from infix to prefix, or from postfix to infix, or from postfix to prefix?  All of these translations involve shifting an operator from the middle or the right forward to the front or the middle.  Describe some of the problems that you would expect to encounter with the programming skills that you have now.

** /Eliminate GOTO/:

It is at least cumbersome and probably quite difficult to rewrite the program without GOTO.  Do try it, but ensure that your program behaves either like the original or as described in the manual (in case there is a difference!).

** /Reading/: 

If you had problems with understanding the PASCAL program, then you should consult any one of the many and often very good introductory books on PASCAL.  If you had problems getting your program into the computer, read the manual for your editor.

