02-prefix-to-infix.html
<div id="outline-container-sec-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> <i>More difficult translations</i>:</h3>
<div class="outline-text-3" id="text-5-10">
<p>
Why is there no exercise to translate from infix to prefix, or from postfix to infix, or from postfix to prefix?  All of these translations involve shifting an operator from the middle or the right forward to the front or the middle.  Describe some of the problems that you would expect to encounter with the programming skills that you have now.
</p>
</div>
</div>
<div id="outline-container-sec-5-11" class="outline-3">
<h3 id="sec-5-11"><span class="section-number-3">5.11</span> <i>Eliminate GOTO</i>:</h3>
<div class="outline-text-3" id="text-5-11">
<p>
It is at least cumbersome and probably quite difficult to rewrite the program without GOTO.  Do try it, but ensure that your program behaves either like the original or as described in the manual (in case there is a difference!).
</p>
</div>
</div>
<div id="outline-container-sec-5-12" class="outline-3">
<h3 id="sec-5-12"><span class="section-number-3">5.12</span> <i>Reading</i>:</h3>
<div class="outline-text-3" id="text-5-12">
<p>
If you had problems with understanding the PASCAL program, then you should consult any one of the many and often very good introductory books on PASCAL.  If you had problems getting your program into the computer, read the manual for your editor.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
